Sequence concat
